artillery-tests/user.test.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 6
      arrivalRate: 1
      name: Warm up
    - duration: 12
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 60
      arrivalRate: 10
      name: Sustained load

scenarios:
  - name: 'Test Users CRUD'
    flow:
      - post:
          url: '/login'
          json:
            login: 'admin'
            password: 'admin'
          capture:
            - json: '$.token'
              as: 'JWT'
      - post:
          url: '/users'
          json:
            name: 'new user'
            login: 'newUser'
            password: 'newuser123'
          headers:
            Authorization: 'Bearer {{JWT}}'